witalis3/UA3REO-DDC-Transceiver/STM32/Src/peripheral.c
void PERIPH_ProcessSWRMeter(void)
{
	ADC_ChannelConfTypeDef sConfig = {0};
	sConfig.Rank = 1;
	sConfig.SamplingTime = ADC_SAMPLETIME_8CYCLES_5;

	sConfig.Channel = ADC_CHANNEL_11; // Forward PC1
	HAL_ADC_ConfigChannel(&hadc1, &sConfig);
	HAL_ADC_Start(&hadc1);													   // запускаем преобразование сигнала АЦП
	HAL_ADC_PollForConversion(&hadc1, 100);									   // ожидаем окончания преобразования
	float32_t forward = (float32_t)HAL_ADC_GetValue(&hadc1) * 3.3f / 65535.0f; // читаем полученное значение в переменную adc
	HAL_ADC_Stop(&hadc1);
	forward = forward / (CALIBRATE.swr_meter_Rbottom / (CALIBRATE.swr_meter_Rtop + CALIBRATE.swr_meter_Rbottom)); //корректируем напряжение исходя из делителя
	forward += CALIBRATE.swr_meter_fwd_diff;																	  //корректируем напряжение по калибровке
	if (forward < 0.001f)																						  //меньше 1mV не измеряем
	{
		TRX_SWR_forward = 0.0f;
		TRX_SWR_backward = 0.0f;
		TRX_SWR = 1.0f;
		return;
	}

	forward += CALIBRATE.swr_meter_diode_drop;			// падение на диоде
	forward = forward * CALIBRATE.swr_meter_trans_rate; // падение на трансформаторе

	sConfig.Channel = ADC_CHANNEL_10; // Backward PC0
	HAL_ADC_ConfigChannel(&hadc1, &sConfig);
	HAL_ADC_Start(&hadc1);														// запускаем преобразование сигнала АЦП
	HAL_ADC_PollForConversion(&hadc1, 100);										// ожидаем окончания преобразования
	float32_t backward = (float32_t)HAL_ADC_GetValue(&hadc1) * 3.3f / 65535.0f; // читаем полученное значение в переменную adc

	HAL_ADC_Stop(&hadc1);
	backward = backward / (CALIBRATE.swr_meter_Rbottom / (CALIBRATE.swr_meter_Rtop + CALIBRATE.swr_meter_Rbottom)); //корректируем напряжение исходя из делителя
	backward += CALIBRATE.swr_meter_ref_diff;																		//корректируем напряжение по калибровке
	backward -= forward * CALIBRATE.swr_meter_ref_sub;																//% вычитаемого FWD из REF
	if (backward >= 0.001f)
	{
		backward += CALIBRATE.swr_meter_diode_drop;			  // падение на диоде
		backward = backward * CALIBRATE.swr_meter_trans_rate; // падение на трансформаторе
	}
	if (backward < 0.001f) //меньше 1mV не измеряем
		backward = 0.001f;

	TRX_SWR_forward = TRX_SWR_forward + ((forward - TRX_SWR_forward) / 10.0f);
	TRX_SWR_backward = TRX_SWR_backward + ((backward - TRX_SWR_backward) / 10.0f);
	TRX_SWR = (TRX_SWR_forward + TRX_SWR_backward) / (TRX_SWR_forward - TRX_SWR_backward);
	if (TRX_SWR_backward > TRX_SWR_forward)
		TRX_SWR = 10.0f;
	if (TRX_SWR > 10.0f)
		TRX_SWR = 10.0f;
	float32_t ref_power = (TRX_SWR_backward * TRX_SWR_backward) / 50.0f;

	if (TRX_SWR >= SWR_CRITICAL && ref_power > 1.0f && TRX_getMode(CurrentVFO()) != TRX_MODE_LOOPBACK) //опасный порог КСВ, отключаем передачу
	{
		TRX_Time_InActive = 0;
		TRX_Tune = false;
		TRX_ptt_hard = false;
		TRX_ptt_cat = false;
		TRX_Restart_Mode();
		NeedSaveSettings = true;
		LCD_UpdateQuery.StatusInfoGUI = true;
		LCD_UpdateQuery.TopButtons = true;
	}
	/*
	float32_t power = (TRX_SWR_forward * TRX_SWR_forward) / 50.0f;
	if(power<0.0f) power=0.0f;
	sendToDebug_float32(TRX_SWR_forward,false);
	sendToDebug_float32(TRX_SWR_backward,false);
	sendToDebug_float32(TRX_SWR,false);
	sendToDebug_float32(power,false);
	sendToDebug_newline();
	*/
}

static uint16_t PERIPH_ReadMCP3008_Value(uint8_t channel, GPIO_TypeDef *CS_PORT, uint16_t CS_PIN)
{
	uint8_t outData[3] = {0};
	uint8_t inData[3] = {0};
	uint16_t mcp3008_value = 0;

	outData[0] = 0x18 | channel;
	bool res = PERIPH_SPI_Transmit(outData, inData, 3, CS_PORT, CS_PIN, false);
	if (res == false)
		return 65535;
	mcp3008_value = 0 | ((inData[1] & 0x3F) << 4) | (inData[2] & 0xF0 >> 4);

	return mcp3008_value;
}

bool PERIPH_SPI_Transmit(uint8_t *out_data, uint8_t *in_data, uint8_t count, GPIO_TypeDef *CS_PORT, uint16_t CS_PIN, bool hold_cs)
{
	if (PERIPH_SPI_busy)
	{
		sendToDebug_strln("SPI Conflict");
		return false;
	}
	PERIPH_SPI_busy = true;
	HAL_IWDG_Refresh(&hiwdg1);
	memset(in_data, 0x00, count);
	HAL_GPIO_WritePin(CS_PORT, CS_PIN, GPIO_PIN_RESET);
	HAL_StatusTypeDef res = 0;
	if(in_data==NULL)
		res = HAL_SPI_Transmit(&hspi2, out_data, count, 0x100);
	else if(out_data==NULL)
		res = HAL_SPI_Receive(&hspi2, in_data, count, 0x100);
	else
		res = HAL_SPI_TransmitReceive(&hspi2, out_data, in_data, count, 0x100);
	if(!hold_cs)
		HAL_GPIO_WritePin(CS_PORT, CS_PIN, GPIO_PIN_SET);
	PERIPH_SPI_busy = false;
	if (res == HAL_TIMEOUT || res == HAL_ERROR)
		return false;
	else
		return true;
}
